content/main/20211121163111-information_updating_machine.md
+++
title = "Information Updating Machine"
author = ["System Administrator"]
draft = false
+++

updating informations gethered from:

-   Website RSS Feeds
-   Blog feeds
-   Mailbox(mail.xjtlu)
-   Wechat groups
-   Ebridge
-   Learning mall
-   Texting Inbox


## Period {#period}


### Email {#email}

Every day at 9:00.
In days 9:00 is occupied, the next leisure.


## Process {#process}


### Email {#email}


#### 1. Deleting/Filtering {#1-dot-deleting-filtering}

Delete everything I thought is irrelevent to me


#### 2. Important things {#2-dot-important-things}

Record everything that's nessacery into my agenda.


#### 3. Oppurtunity {#3-dot-oppurtunity}

Fetch oppurtunity into the coresponding Role


### Course/task (asigned) information {#course-task--asigned--information}


#### Information Scheme {#information-scheme}

<!--list-separator-->

-  Information host position

    The website/software/address that the information is held.

<!--list-separator-->

-  Local task position

    The place I kept the information to myself, like Emacs Org-roam


#### Steps {#steps}

<!--list-separator-->

-  1. Get to the host

    have `Information host position` connected at hand

<!--list-separator-->

-  2. Find unfamiliar information

    Mark them up in the task description

    ```text
    + [ ] CPT103 CW1 Information
    + [ ] CPT111 CW2 Information
    ```

    This also have process control use.

<!--list-separator-->

-  3. Record neccesary Information locally

    Write down the Deadlines/schedule/spec/... in my `Local task position`

<!--list-separator-->

-  4. Make them ready for a scheme session.

    They should be automatically ready for scheme session. So the format of recording in step 3 could be modified.